#+TITLE: Manifold learning using scVI
#+SETUPFILE: setup.org

* Introduction

  [[https://github.com/YosefLab/scVI][Lopez et al 2018]] have already done the hard work of implementing VAE. Use
  their implementation to study the geometry of the embedding.

* Setup                                                            :noexport:

  #+BEGIN_SRC emacs-lisp
    (setq python-shell-prompt-detect-failure-warning nil)
    (org-babel-lob-ingest "/home/aksarkar/.emacs.d/org-templates/library.org")
  #+END_SRC

  #+RESULTS:
  : 1

  #+CALL: ipython3(memory="16G",partition="gpu",opts="--gres=gpu:1",venv="singlecell") :dir /scratch/midway2/aksarkar/manifold

  #+RESULTS:
  : Submitted batch job 46766834

  #+BEGIN_SRC ipython
    import glob
    import numpy as np
    import pandas as pd
    import scipy.io as si
    import torch.utils.data

    import scvi.models
    import scvi.train
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  # Out[5]:
  :END:

  #+BEGIN_SRC ipython
    %matplotlib inline
    %config InlineBackend.figure_formats = set(['retina'])
    import colorcet
    import matplotlib.pyplot as plt
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  # Out[2]:
  :END:

* Download the data

  Download [[https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE106273][mammary epithelial cell time course]] ([[https://www.nature.com/articles/s41467-017-02001-5][Bach et al 2017]]).

  #+BEGIN_SRC sh :dir /project2/mstephens/aksarkar/projects/singlecell-ideas/data
    mkdir -p GSE106273
    curl -s "https://www.ncbi.nlm.nih.gov/geo/download/?acc=GSE106273&format=file" | tar xf - -C GSE106273
  #+END_SRC

  #+RESULTS:

* Fit the model

  Read the data.

  #+BEGIN_SRC ipython
    xs = [si.mmread(f) for f in glob.glob("/project2/mstephens/aksarkar/projects/singlecell-ideas/data/GSE106273/*.mtx.gz")]
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  # Out[6]:
  :END:

  #+BEGIN_SRC ipython
    training = torch.data.DataLoader
  #+END_SRC
